<details>
<summary>Execution result of "run-all plan" in "infrastructure/cloud"</summary>

```terraform
time=2023-12-27T16:37:32Z level=info msg=The stack at /github/workspace/infrastructure/cloud will be processed in the following order for command plan:
Group 1
- Module /github/workspace/infrastructure/cloud/aws/jung2bot-dev/dynamodb
- Module /github/workspace/infrastructure/cloud/aws/jung2bot-dev/sqs
- Module /github/workspace/infrastructure/cloud/aws/jung2bot/dynamodb
- Module /github/workspace/infrastructure/cloud/aws/jung2bot/sqs
- Module /github/workspace/infrastructure/cloud/b2/bucket
- Module /github/workspace/infrastructure/cloud/cloudflare/access
- Module /github/workspace/infrastructure/cloud/cloudflare/tunnel
- Module /github/workspace/infrastructure/cloud/uptime-robot/otaru

Group 2
- Module /github/workspace/infrastructure/cloud/cloudflare/dns



Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...

Initializing provider plugins...
- Reusing previous version of integrations/github from the dependency lock file
Initializing modules...
Downloading registry.terraform.io/terraform-aws-modules/sqs/aws 4.1.0 for sqs...
- Reusing previous version of vexxhost/uptimerobot from the dependency lock file
Downloading registry.terraform.io/terraform-aws-modules/dynamodb-table/aws 4.0.0 for dynamodb_table...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
Initializing modules...
Initializing modules...
- Reusing previous version of backblaze/b2 from the dependency lock file
Downloading registry.terraform.io/terraform-aws-modules/dynamodb-table/aws 4.0.0 for dynamodb_table...
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
Downloading registry.terraform.io/terraform-aws-modules/sqs/aws 4.1.0 for sqs...
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Finding vexxhost/uptimerobot versions matching "~> 0.8"...

Initializing provider plugins...
- Reusing previous version of vexxhost/uptimerobot from the dependency lock file
- sqs in .terraform/modules/sqs

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file

Initializing provider plugins...
- Reusing previous version of integrations/github from the dependency lock file
- dynamodb_table in .terraform/modules/dynamodb_table

Initializing provider plugins...
- Reusing previous version of backblaze/b2 from the dependency lock file
- dynamodb_table in .terraform/modules/dynamodb_table

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Finding vexxhost/uptimerobot versions matching "~> 0.8"...
- sqs in .terraform/modules/sqs

Initializing provider plugins...
- Reusing previous version of vexxhost/uptimerobot from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of vexxhost/uptimerobot from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Installing vexxhost/uptimerobot v0.8.2...
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of vexxhost/uptimerobot from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of vexxhost/uptimerobot from the dependency lock file
- Installing backblaze/b2 v0.8.7...
- Installing hashicorp/aws v5.31.0...
- Installing cloudflare/cloudflare v4.17.0...
- Installing hashicorp/aws v5.31.0...
- Installing hashicorp/aws v5.21.0...
- Installing vexxhost/uptimerobot v0.8.2...
- Installing cloudflare/cloudflare v4.16.0...
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)
- Installing hashicorp/aws v5.21.0...
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)
- Installing hashicorp/aws v5.31.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed cloudflare/cloudflare v4.17.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing vexxhost/uptimerobot v0.8.2...
- Installing vexxhost/uptimerobot v0.8.2...
- Installed backblaze/b2 v0.8.7 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.21.0...
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)
- Installing hashicorp/aws v5.21.0...
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)
- Installing hashicorp/aws v5.22.0...
- Installed cloudflare/cloudflare v4.21.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.42.0...
- Installed integrations/github v5.42.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing vexxhost/uptimerobot v0.8.2...
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)
- Installing hashicorp/aws v5.31.0...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installed hashicorp/aws v5.31.0 (signed by HashiCorp)
- Installed hashicorp/aws v5.31.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.7...
- Installing backblaze/b2 v0.8.7...
- Installed hashicorp/aws v5.31.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.7...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.16.0...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing cloudflare/cloudflare v4.16.0...
- Installing backblaze/b2 v0.8.4...
- Installed backblaze/b2 v0.8.7 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.21.0...
- Installed backblaze/b2 v0.8.7 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.21.0...
- Installed hashicorp/aws v5.22.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installed backblaze/b2 v0.8.7 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing integrations/github v5.40.0...
- Installing integrations/github v5.40.0...
- Installing cloudflare/cloudflare v4.21.0...
- Installed cloudflare/cloudflare v4.21.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.42.0...
- Installed cloudflare/cloudflare v4.21.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.42.0...
- Installed cloudflare/cloudflare v4.21.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.42.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installing vexxhost/uptimerobot v0.8.2...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed integrations/github v5.42.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing vexxhost/uptimerobot v0.8.2...
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed integrations/github v5.42.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing vexxhost/uptimerobot v0.8.2...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed hashicorp/aws v5.31.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed integrations/github v5.42.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
cloudflare_tunnel.this: Refreshing state... [id=de250703-6c08-400d-b568-bc0aa34cabaf]
data.uptimerobot_account.this: Reading...
data.uptimerobot_account.this: Read complete after 0s [id=2023-12-27 16:38:07.787703976 +0000 UTC]
data.uptimerobot_alert_contact.this: Reading...
data.uptimerobot_alert_contact.this: Read complete after 0s [id=01487022]
uptimerobot_monitor.this: Refreshing state... [id=795551117]
cloudflare_access_application.this: Refreshing state... [id=bcaa03ae-0a94-42ad-935c-487ca0a80723]
data.github_ip_ranges.this: Reading...
data.github_ip_ranges.this: Read complete after 0s [id=github-ip-ranges]
cloudflare_access_policy.this: Refreshing state... [id=1b62d9cb-f555-4d23-b815-dfe3f92bd2a1]
cloudflare_access_policy.telegram: Refreshing state... [id=3a7f9d55-4ddb-40bf-9671-793283e54b52]
cloudflare_access_policy.github: Refreshing state... [id=2a1fc41f-8d41-4f1f-8e72-91b0970ab129]
cloudflare_access_policy.uptime_robot: Refreshing state... [id=fd540ff0-edd5-4f64-b683-a8dd575af941]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
b2_bucket.this: Refreshing state... [id=62c5440382b735a482bf081b]
data.github_ip_ranges.this: Reading...
data.github_ip_ranges.this: Read complete after 1s [id=github-ip-ranges]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=477397881710]
data.aws_caller_identity.current: Reading...
module.sqs["event"].aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/477397881710/jung2bot-dev-event-queue]
data.aws_caller_identity.current: Read complete after 0s [id=477397881710]
module.dynamodb_table["chatIds"].aws_dynamodb_table.this[0]: Refreshing state... [id=jung2bot-dev-chatIds]
module.dynamodb_table["messages"].aws_dynamodb_table.this[0]: Refreshing state... [id=jung2bot-dev-messages]
aws_sqs_queue_policy.this["event"]: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/477397881710/jung2bot-dev-event-queue]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dynamodb_table["chatIds"].aws_appautoscaling_policy.table_read_policy[0] will be created
  + resource "aws_appautoscaling_policy" "table_read_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBReadCapacityUtilization:table/jung2bot-prod-chatIds"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/jung2bot-prod-chatIds"
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 0
          + scale_out_cooldown = 0
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table["chatIds"].aws_appautoscaling_policy.table_write_policy[0] will be created
  + resource "aws_appautoscaling_policy" "table_write_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBWriteCapacityUtilization:table/jung2bot-prod-chatIds"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/jung2bot-prod-chatIds"
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 0
          + scale_out_cooldown = 0
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table["chatIds"].aws_appautoscaling_target.table_read[0] will be created
  + resource "aws_appautoscaling_target" "table_read" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1000
      + min_capacity       = 1
      + resource_id        = "table/jung2bot-prod-chatIds"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = {
          + "Source"    = "github-otaru"
          + "Terraform" = "true"
        }
    }

  # module.dynamodb_table["chatIds"].aws_appautoscaling_target.table_write[0] will be created
  + resource "aws_appautoscaling_target" "table_write" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1000
      + min_capacity       = 1
      + resource_id        = "table/jung2bot-prod-chatIds"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = {
          + "Source"    = "github-otaru"
          + "Terraform" = "true"
        }
    }

  # module.dynamodb_table["chatIds"].aws_dynamodb_table.autoscaled[0] will be created
  + resource "aws_dynamodb_table" "autoscaled" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "chatId"
      + id               = (known after apply)
      + name             = "jung2bot-prod-chatIds"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "Name" = "jung2bot-prod-chatIds"
        }
      + tags_all         = {
          + "Name"      = "jung2bot-prod-chatIds"
          + "Source"    = "github-otaru"
          + "Terraform" = "true"
        }
      + write_capacity   = 1

      + attribute {
          + name = "chatId"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + update = "1h"
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

  # module.dynamodb_table["messages"].aws_appautoscaling_policy.table_read_policy[0] will be created
  + resource "aws_appautoscaling_policy" "table_read_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBReadCapacityUtilization:table/jung2bot-prod-messages"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/jung2bot-prod-messages"
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 0
          + scale_out_cooldown = 0
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table["messages"].aws_appautoscaling_policy.table_write_policy[0] will be created
  + resource "aws_appautoscaling_policy" "table_write_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "DynamoDBWriteCapacityUtilization:table/jung2bot-prod-messages"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "table/jung2bot-prod-messages"
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 0
          + scale_out_cooldown = 0
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table["messages"].aws_appautoscaling_target.table_read[0] will be created
  + resource "aws_appautoscaling_target" "table_read" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1000
      + min_capacity       = 1
      + resource_id        = "table/jung2bot-prod-messages"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = {
          + "Source"    = "github-otaru"
          + "Terraform" = "true"
        }
    }

  # module.dynamodb_table["messages"].aws_appautoscaling_target.table_write[0] will be created
  + resource "aws_appautoscaling_target" "table_write" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1000
      + min_capacity       = 1
      + resource_id        = "table/jung2bot-prod-messages"
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = {
          + "Source"    = "github-otaru"
          + "Terraform" = "true"
        }
    }

  # module.dynamodb_table["messages"].aws_dynamodb_table.autoscaled[0] will be created
  + resource "aws_dynamodb_table" "autoscaled" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "chatId"
      + id               = (known after apply)
      + name             = "jung2bot-prod-messages"
      + range_key        = "dateCreated"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "Name" = "jung2bot-prod-messages"
        }
      + tags_all         = {
          + "Name"      = "jung2bot-prod-messages"
          + "Source"    = "github-otaru"
          + "Terraform" = "true"
        }
      + write_capacity   = 1

      + attribute {
          + name = "chatId"
          + type = "N"
        }
      + attribute {
          + name = "dateCreated"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + update = "1h"
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sqs_queue_policy.this["event"] will be created
  + resource "aws_sqs_queue_policy" "this" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.sqs["event"].aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 86400
      + kms_master_key_id                 = "alias/aws/sqs"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "jung2bot-prod-event-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "Source"    = "github-otaru"
          + "Terraform" = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 100
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Initializing the backend...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of backblaze/b2 from the dependency lock file
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of integrations/github from the dependency lock file
- Reusing previous version of vexxhost/uptimerobot from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.21.0...
- Installed hashicorp/aws v5.21.0 (signed by HashiCorp)
- Installing backblaze/b2 v0.8.4...
- Installed backblaze/b2 v0.8.4 (signed by a HashiCorp partner, key ID 83D9CAF4848490D6)
- Installing cloudflare/cloudflare v4.16.0...
- Installed cloudflare/cloudflare v4.16.0 (self-signed, key ID C76001609EE3B136)
- Installing integrations/github v5.40.0...
- Installed integrations/github v5.40.0 (signed by a HashiCorp partner, key ID 38027F80D7FD5FB2)
- Installing vexxhost/uptimerobot v0.8.2...
- Installed vexxhost/uptimerobot v0.8.2 (self-signed, key ID 8FF00CD0B5FEAF59)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!
cloudflare_record.internal_record["kiali_internal"]: Refreshing state... [id=3e29d0bc6567b4c0fecd6db58e432160]
cloudflare_record.internal_record["jellyfin_internal"]: Refreshing state... [id=62786f77078b02d784342427605ba9e9]
cloudflare_record.public_record: Refreshing state... [id=16e19a8901e14239e7345e3922f318f9]
cloudflare_record.internal_record["home_assistant_internal"]: Refreshing state... [id=0450593da9fcf9f32802e5152f53c349]
cloudflare_record.internal_record["sftpgo_internal"]: Refreshing state... [id=d53e66b848b3967bd5a9885eb2c8e08c]
cloudflare_record.internal_record["argocd_internal"]: Refreshing state... [id=ad2633b9ce86a1786416dd851cb5c4d3]
cloudflare_record.internal_record["adguard_internal"]: Refreshing state... [id=5803590e9218027a34aae666383f8211]
cloudflare_record.internal_record["longhorn_internal"]: Refreshing state... [id=9d9e7849509ddd1ca1420bfb93085ddb]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

</details>
    